Revise system architecture documentation
